Revit 2024 API
BuiltInFailures.ConnectorFailures.JointSizeMismatch Property
 The element has a connector with a fitting joint size mismatch
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId JointSizeMismatch { get; }
Visual Basic
Public Shared ReadOnly Property JointSizeMismatch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ JointSizeMismatch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace